tap 'homebrew/bundle'
tap "isen-ng/dotnet-sdk-versions"

cask_args appdir: '/Applications'

brew 'ag'
brew 'awscli'
brew 'awscli-local'
brew 'bash'
brew 'bat'
brew 'btop'
brew 'buf'
brew 'chafa'
brew 'curl'
brew 'duf'
brew 'dust'
brew 'eza'
brew 'fastfetch'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'go'
brew 'gnu-sed'
brew 'gping'
brew 'graphviz'
brew 'ipcalc'
brew 'jq'
brew 'lazygit'
brew 'lnav'
brew 'make'
brew 'mas'
brew 'mpv'
brew 'node'
brew 'neovim'
brew 'okta-aws-cli'
brew 'openssh'
brew 'openssl'
brew 'powerlevel10k'
brew 'procs'
brew 'protobuf'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'ripgrep'
brew 'sd'
brew 'tlrc'
brew 'tmux'
brew 'xh'
brew 'yt-dlp'
brew 'yazi'
brew 'zig'
brew 'zoxide'
brew 'zsh-autosuggestions'
brew 'zsh-fast-syntax-highlighting'

cask '1password'
cask 'appcleaner'
cask 'docker'
cask 'font-fira-code-nerd-font'
cask 'fork'
cask 'ghostty'
cask 'intellij-idea'
cask 'keka'
cask 'nikitabobko/tap/aerospace'
cask 'obsidian'
cask 'raycast'
cask 'rider'
cask 'shottr'
cask 'spotify'
cask 'vivaldi'

mas 'Amphetamine', id: 937984704
mas 'Numbers', id: 409203825
